---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.NavisworksExporterService
source: html/c0c5897c-315d-effd-e0ab-4627bf678134.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.NavisworksExporterService Property

The external service which supports export of the model to Navisworks.

## Syntax (C#)
```csharp
public static ExternalServiceId NavisworksExporterService { get; }
```